tap "homebrew/command-not-found"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Improved top (interactive process viewer)
brew "htop"
# GUI for vim, made for macOS
brew "macvim"
# Unix documentation system
brew "man-db"
# Powerful paging program
brew "most"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Unix pager optimized for psql
brew "pspg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Markup-based typesetting system
brew "typst"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Application uninstaller
cask "appcleaner"
# Web browser
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "font-ubuntu-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source, KeePass-client and password manager
cask "macpass"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Neovim Client
cask "neovide-app"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "pomdtr.excalidraw-editor"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vscodevim.vim"
