# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Package manager for the Lua programming language
brew "luarocks"
# Unix documentation system
brew "man-db"
# Powerful paging program
brew "most"
# NCurses Disk Usage
brew "ncdu"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Unix pager optimized for psql
brew "pspg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Markup-based typesetting system
brew "typst"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Application uninstaller
cask "appcleaner"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Clean keyboard and trackpad
cask "cleanupbuddy"
# Web browser
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-victor-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source, KeePass-client and password manager
cask "macpass"
# Neovim Client
cask "neovide-app"
# Colour picker for colours onscreen
cask "pika"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
